In [1]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
import pandas as pd
import numpy as np

In [3]:
df= pd.read_csv('carprices.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [4]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

In [5]:
dfle= df

In [6]:
le=LabelEncoder()
dfle['Car Model']=le.fit_transform(dfle[['Car Model']])

In [7]:
dfle

    Car Model  Mileage  Sell Price($)  Age(yrs)
0           1    69000          18000         6
1           1    35000          34000         3
2           1    57000          26100         5
3           1    22500          40000         2
4           1    46000          31500         4
5           0    59000          29400         5
6           0    52000          32000         5
7           0    72000          19300         6
8           0    91000          12000         8
9           2    67000          22000         6
10          2    83000          20000         7
11          2    79000          21000         7
12          2    59000          33000         5

In [8]:
X=dfle[['Car Model','Mileage','Age(yrs)']].values
X

array([[    1, 69000,     6],
       [    1, 35000,     3],
       [    1, 57000,     5],
       [    1, 22500,     2],
       [    1, 46000,     4],
       [    0, 59000,     5],
       [    0, 52000,     5],
       [    0, 72000,     6],
       [    0, 91000,     8],
       [    2, 67000,     6],
       [    2, 83000,     7],
       [    2, 79000,     7],
       [    2, 59000,     5]], dtype=int64)

In [9]:
y=dfle[['Sell Price($)']].values
y

array([[18000],
       [34000],
       [26100],
       [40000],
       [31500],
       [29400],
       [32000],
       [19300],
       [12000],
       [22000],
       [20000],
       [21000],
       [33000]], dtype=int64)

In [10]:
#X=X.toarray()
ct=ColumnTransformer([('Car Model',OneHotEncoder(),[0])],remainder='passthrough')

In [11]:
X=ct.fit_transform(X)
X

array([[0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [12]:
X=X[:,1:]
X

array([[1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [13]:
from sklearn.linear_model import LinearRegression

In [14]:
reg=LinearRegression()

In [15]:
reg.fit(X,y)

LinearRegression()

Exercise
At the same level as this notebook on github, there is an Exercise folder that contains carprices.csv. This file has car sell prices for 3 different models. First plot data points on a scatter plot chart to see if linear regression model can be applied. If yes, then build a model that can answer following questions,

1) Predict price of a mercedez benz that is 4 yr old with mileage 45000

2) Predict price of a BMW X5 that is 7 yr old with mileage 86000

3) Tell me the score (accuracy) of your model. (Hint: use LinearRegression().score())

In [16]:
reg.predict([[0,1,45000,4]])

array([[36991.31721062]])

In [17]:
reg.predict([[1,0,86000,7]])

array([[11080.74313219]])

In [18]:
reg.score(X,y)

0.9417050937281082

### Apply get_dummies()

In [19]:
dummies=pd.get_dummies(df['Car Model'])

In [20]:
dummies

    0  1  2
0   0  1  0
1   0  1  0
2   0  1  0
3   0  1  0
4   0  1  0
5   1  0  0
6   1  0  0
7   1  0  0
8   1  0  0
9   0  0  1
10  0  0  1
11  0  0  1
12  0  0  1

In [21]:
dummies.columns

Int64Index([0, 1, 2], dtype='int64')

In [22]:
merged=pd.concat([df,dummies],axis='columns')

In [23]:
merged

    Car Model  Mileage  Sell Price($)  Age(yrs)  0  1  2
0           1    69000          18000         6  0  1  0
1           1    35000          34000         3  0  1  0
2           1    57000          26100         5  0  1  0
3           1    22500          40000         2  0  1  0
4           1    46000          31500         4  0  1  0
5           0    59000          29400         5  1  0  0
6           0    52000          32000         5  1  0  0
7           0    72000          19300         6  1  0  0
8           0    91000          12000         8  1  0  0
9           2    67000          22000         6  0  0  1
10          2    83000          20000         7  0  0  1
11          2    79000          21000         7  0  0  1
12          2    59000          33000         5  0  0  1

In [24]:
merged.drop(['Car Model'],axis='columns',inplace=True)

In [25]:
merged

    Mileage  Sell Price($)  Age(yrs)  0  1  2
0     69000          18000         6  0  1  0
1     35000          34000         3  0  1  0
2     57000          26100         5  0  1  0
3     22500          40000         2  0  1  0
4     46000          31500         4  0  1  0
5     59000          29400         5  1  0  0
6     52000          32000         5  1  0  0
7     72000          19300         6  1  0  0
8     91000          12000         8  1  0  0
9     67000          22000         6  0  0  1
10    83000          20000         7  0  0  1
11    79000          21000         7  0  0  1
12    59000          33000         5  0  0  1

In [27]:
merged.drop(merged.columns[3], axis=1 , inplace=True)

In [28]:
merged.columns

Index(['Mileage', 'Sell Price($)', 'Age(yrs)', 1, 2], dtype='object')

In [29]:
merged

    Mileage  Sell Price($)  Age(yrs)  1  2
0     69000          18000         6  1  0
1     35000          34000         3  1  0
2     57000          26100         5  1  0
3     22500          40000         2  1  0
4     46000          31500         4  1  0
5     59000          29400         5  0  0
6     52000          32000         5  0  0
7     72000          19300         6  0  0
8     91000          12000         8  0  0
9     67000          22000         6  0  1
10    83000          20000         7  0  1
11    79000          21000         7  0  1
12    59000          33000         5  0  1

In [30]:
X = merged.drop('Sell Price($)',axis='columns')

In [31]:
X

    Mileage  Age(yrs)  1  2
0     69000         6  1  0
1     35000         3  1  0
2     57000         5  1  0
3     22500         2  1  0
4     46000         4  1  0
5     59000         5  0  0
6     52000         5  0  0
7     72000         6  0  0
8     91000         8  0  0
9     67000         6  0  1
10    83000         7  0  1
11    79000         7  0  1
12    59000         5  0  1

In [32]:
y=merged['Sell Price($)']

In [34]:
model=LinearRegression()
model.fit(X,y)

LinearRegression()

In [35]:
model.predict([[45000,4,0,1]])

array([36991.31721061])

In [36]:
model.predict([[86000,7,1,0]])

array([11080.74313219])

In [37]:
model.score(X,y)

0.9417050937281082